app/controllers/food_predictions_controller.rb

  def index
    #change nil-> false pending
    today = DateTime.current
    @all_orders = FoodPrediction.where(created_at: [(today.beginning_of_day)..(today.end_of_day)])
---
SELECT  "food_predictions".* FROM "food_predictions" WHERE ("food_predictions"."created_at" BETWEEN '2018-03-20 00:00:00' AND '2018-03-20 23:59:59.999999') ORDER BY "food_predictions"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def new
    @all_food = Food.all
---
SELECT "foods".* FROM "foods"

  def create
    today = DateTime.current
    @food_prediction = FoodPrediction.where(created_at: [(today.beginning_of_day)..(today.end_of_day)]).where(food_id: food_prediction_params[:food_id]).last
    unless @food_prediction.present?
        @food_prediction = FoodPrediction.new(food_prediction_params)
    end
    @food_prediction.userr = current_user if current_user.present?
    if @food_prediction.save!
---
SELECT  "food_predictions".* FROM "food_predictions" WHERE ("food_predictions"."created_at" BETWEEN '2018-03-21 00:00:00' AND '2018-03-21 23:59:59.999999') AND "food_predictions"."food_id" = ? ORDER BY "food_predictions"."id" DESC LIMIT ?  [["food_id", 1], ["LIMIT", 1]]
SELECT  "userrs".* FROM "userrs" WHERE "userrs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "food_predictions" ("food_id", "prediction", "userr_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["food_id", 2], ["prediction", 23], ["userr_id", 1], ["created_at", "2018-04-26 10:31:13.862732"], ["updated_at", "2018-04-26 10:31:13.862732"]]

  def report
    today = DateTime.current
    all_orders = FoodPrediction.where(created_at: [(today.beginning_of_day)..(today.end_of_day)]).where(userr_id: current_user.id)
    @all_food=Food.all
    @daily_prediction_matcher_report=[]
    @all_food.each do |food|
      @daily_prediction_matcher_report[food.id]={} unless @daily_prediction_matcher_report[food.id].present?
      @daily_prediction_matcher_report[food.id]["food_name"] = food.name
      @daily_prediction_matcher_report[food.id]["prediction"] = all_orders.where(food_id: food.id).last.prediction rescue -1
      order_table =OrderTable.where(created_at: [(today.beginning_of_day)..(today.end_of_day)]).where(userr_id: current_user.id).where(is_deleted: nil).where(food_id: food.id)
---
SELECT  "food_predictions".* FROM "food_predictions" WHERE ("food_predictions"."created_at" BETWEEN '2018-03-21 00:00:00' AND '2018-03-21 23:59:59.999999') AND "food_predictions"."userr_id" = ? AND "food_predictions"."food_id" = ? ORDER BY "food_predictions"."id" DESC LIMIT ?  [["userr_id", 1], ["food_id", 1], ["LIMIT", 1]]
SELECT "foods".* FROM "foods"
SELECT "order_tables".* FROM "order_tables" WHERE ("order_tables"."created_at" BETWEEN '2018-03-21 00:00:00' AND '2018-03-21 23:59:59.999999') AND "order_tables"."userr_id" = ? AND "order_tables"."is_deleted" IS NULL AND "order_tables"."food_id" = ?  [["userr_id", 1], ["food_id", 1]]