app/controllers/order_tables_controller.rb

SELECT "order_tables".* FROM "order_tables" WHERE "order_tables"."userr_id" = ? AND "order_tables"."is_deleted" = ? AND ("order_tables"."created_at" BETWEEN '2018-03-21 00:00:00' AND '2018-03-21 23:59:59.999999')  [["userr_id", 1], ["is_deleted", "t"]]
SELECT "foods".* FROM "foods"
---
  def index
    #change nil-> false pending
    today = DateTime.current
    if current_user.present?
      all_order_including_deleted=OrderTable.where(userr_id: current_user.id).where(created_at: [(today.beginning_of_day)..(today.end_of_day)]).all
      @all_orders = all_order_including_deleted.where(is_deleted: nil)
      deleted_orders = all_order_including_deleted.where(is_deleted: true)
      @food_hash=[]
      Food.all.each do |food|

SELECT  "order_tables".* FROM "order_tables" WHERE "order_tables"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @this_order = OrderTable.find(params[:id])

SELECT  "userrs".* FROM "userrs" WHERE "userrs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "order_tables" ("userr_id", "food_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["userr_id", 1], ["food_id", 2], ["quantity", 123], ["created_at", "2018-03-20 16:35:05.787214"], ["updated_at", "2018-03-20 16:35:05.787214"]]
---
  def create
    @new_order = OrderTable.new(order_table_params)
    @new_order.userr = current_user if current_user.present?
    if @new_order.save!

SELECT  "order_tables".* FROM "order_tables" WHERE "order_tables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "order_tables" SET "is_deleted" = ?, "updated_at" = ? WHERE "order_tables"."id" = ?  [["is_deleted", "t"], ["updated_at", "2018-03-20 19:31:16.034579"], ["id", 1]]
SELECT  "food_predictions".* FROM "food_predictions" WHERE ("food_predictions"."created_at" BETWEEN '2018-03-21 00:00:00' AND '2018-03-21 23:59:59.999999') AND "food_predictions"."food_id" = ? ORDER BY "food_predictions"."id" DESC LIMIT ?  [["food_id", 3], ["LIMIT", 1]]
---
  def destroy
    del_order = OrderTable.find(params[:id])
    del_order.update_attribute(:is_deleted, true)
    today = DateTime.current
    food_pred  = FoodPrediction.where(created_at: [(today.beginning_of_day)..(today.end_of_day)]).where(food_id: del_order.food_id).last