app/controllers/sessions_controller.rb

SELECT  "userrs".* FROM "userrs" WHERE "userrs"."email" = ? LIMIT ?  [["email", "r@c.com"], ["LIMIT", 1]]
---
  def create
    userr = Userr.find_by(email: params[:session][:email].downcase)