app/controllers/userrs_controller.rb

  def show
    @userr = Userr.find(params[:id])
---
SELECT  "userrs".* FROM "userrs" WHERE "userrs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @userr = Userr.new(user_params)
    if @userr.save
---
INSERT INTO "userrs" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"