app/views/food_predictions/new.html.erb

SELECT "foods".* FROM "foods"
---
    <%= form.label :food_number %><br>
    <%= form.collection_select :food_id, Food.all,:id, :name %>